[
    {
        "blog_title": "Topo Chico is King",
        "blog_body": "If you like La Croix or any of the off-brand seltzer waters sold in grocery stores, I'm sorry to tell you, but you're in the dark. If you like popular mineral waters like San Pellegrino, Perrier, or Borjomi you got another coming pal. The TRUE king of all water, mineral or otherwise was, is, and will always be TOPO CHICO. That stuff slaps harder than Will Smith at the Oscars. It is more hydrating than the fountain of youth. More intoxicating than, well, anything in the world. Thank you for coming to my TED talk."
    },
    {
        "blog_title": "Man oh Man",
        "blog_body": "I have but one qeustion to ask... What's the deal with airplane food? I know the classic bit, by Jerry Seinfeld I think, but I really want to get to the bottom of why it tastes so bland. I've read there's some science behind it, something about how altitude changes taste. I also know that alititude changes how fast water boils, general cook times etc. Why haven't we found a solution to make it taste the same as on the ground though. Airlines have been getting cheaper with thier services for a while now, we're all smushed in those cabins like sardines in a can. It would make sense that they wouldn't put a lot of effort into your food unless you're flying first class. Alas, if only I had a private jet. Then I could hire Gordon Ramsey and all would be well *sigh*."
    },
    {
        "blog_title": "Floyd Rose Guitar Bridge is not Worth it",
        "blog_body": "The Floyd Rose Tremelo System or 'Floyd Rose Bridge' is NOT worth having on your guitar. I know it sounds enticing. Cool name, fancy mechanics, the promise that your guitar will always stay in tune no matter how hard you abuse your sick ass whammy bar. But fellas, it is such a pain in the neck. I've been playing guitar for over 30 years but EVERY time I need new strings I have to take it to guitar center so one of their guru guitar wizards can figure it out because I can't. Much greater tuning stability you say? Sure, I cant deny that. It's awesome when it's working well, but if you run into an issue good luck fixing it yourself."
    },
    {
        "blog_title": "Diggin' for Gold",
        "blog_body": "My Son. I love my Son. I do. But Holy Mother of God above does he pick his nose too much. Like pointer finger tickling the brain levels of digging up in there. He's 20 years old and picks his nose like he's 4. He also flicks his new found 'treasure' whever he wants around the house. It is beyond disgusting. I've tried talking with other moms about this and they all say their sons grew out of this behavior by middle school... or at least they hide it better. I'm at a loss. I can't keep cleaning his boogers off of the furniture and the floors. It's hard to get off of certain fabrics. I want him moved out of the house but all he does is play that stupid 'Elden Ring' game. I want him to spend less time trying to get the Elden Ring and more time trying to get a job!!"
    },

    {
        "blog_title": "Alpha, Sigma, Beta, I don't care!!!",
        "blog_body": "My boyfriend keeps referring to himself as a 'Sigma' male. It's starting to get annoying. He's says Sigma's are better than Alpha 'Chads' and much better than those stupid Beta ****'s. It's been turning him into a snide and hateful man, also pretty narcissistic as well. He used to be so sweet, but now he sees his own masculinity like it's some competition with every other man on earth. He's a scrawny dude and has no self-defense skills at all but walks around like a discount John Wick. I think it's time to break up."
    },

    {
        "blog_title": "Philosophy",
        "blog_body": "I've been racking my brain trying to figure how to manage my stress levels in work and life in general. I've found that certain mindsets and philosophies can be quite beneficial to keep in mind. Think stoicism, confucianism, teachings of various great philosophers etc. It's been helping me a lot. So I say if you're struggling, don't go to a 'self-help' seminar for who knows how much money, dig into some philophy intsead."
    },

    {
        "blog_title": "Portraits and Landscapes",
        "blog_body": "I've been painting since I was 7 years old. It's always been my go to way of releiving stress and escaping the world. I used to draw wonderful portraits. Self-portraits, portraits of my family and friends, even the occasional stranger. But now I'm having a great time drawing landscapes! The Beauty of nature is so amazing and to be able to represent that using only colored paints really makes me giddy. I now go to museums quite often for the sole purpose of finding inspiration through the landscape paintings they have on display. So many of them I wish I could just jump inside and live in, even if only for a second. I love art, and I love Mother Nature. When they are combined it is the most beautiful experience in the world."
    },

    {
        "blog_title": "My Eyes are now Open",
        "blog_body": "Earlier this year I traveled through Ireland and Scotland. The beer in Ireland was beyond phenomenal, smoothest brews I've ever drank. I actually shed a tear. Irish beer tasting like straigh up velvet made me realize the good ol' U.S. of A. has much pride in their flavor but no standard when it comes to mouthfeel. Irish Whiskey was buttery smooth as well! Even the cheap stuff was much easier to drink than anything state-side. And oh boy... when I went to scotland, my eyes were opened. I had an epiphany of sorts. Scotch is now my favorite libation by far. Highland, Lowland, Campbeltown, Speyside, and Islay scotch's are all amazing. The one that sits above the rest for me though are the Islay variety. Especially the Southern Islay Distilleries. Laphroaig, Ardbeg, and my favorite Lagavulin. Such smokey/peaty/seaweedy flavors with heavy sea salt and iodine notes. It's an acquired taste. But once you've acquired it their is nothing better. Get that Jack Daniel's swill out of my face."
    },

    {
        "blog_title": "Difficulty and Reward",
        "blog_body": "I've been playing through the notoriously hard soulsborne games lately by From Software. Demon's Souls, Dark Souls 1-3, Bloodborne, Sekiro, and now Elden Ring. It's gotten me thinking and I've noticed something. If a task or goal is too easy for me to complete or obtain, I feel no reward. I don't feel like I have acheived anything. At first I noticed this within the context of me playing these games, but now I see it applies to the rest of my life as well. I think that's why I put off doing life's most mundane things, because they're simple and easy. I feel no reward in doing them, I just have to do them. If taking out the trash involved complex problem solving and precise hand-eye coordination it would be a lot more fun and I'd feel good for getting it done."
    },

    {
        "blog_title": "Anime in the West",
        "blog_body": "I've noticed Anime has gotten a lot more popular in the last 10 years or so in the werstern world. Friends of mine who would make fun of me before for watching it now tune in as well. Netflix, Hulu, and even Amazon Prime and HBO have been increasing their investment in streaming the medium. It's more mainstream now than it has ever been. I grew up watching Pokemon, Yu-Gi-Oh, and eventually Dragon Ball Z. I was young enough to not even realize they were considered something different from American Cartoons. In College a friend suggested Sword Art Online to me and although I thought it had some glaring isssues it was different enough for me to enjoy. Then I found Jojo's Bizarre Adventure and everything clicked. I had then became and still remain a full-blown 'Weeabo' or 'Otaku'. I even started reading Manga! Berserk, Vinland Saga, and Chainsaw Man by far being my favorite reads. Of course like any other fanbase of a popular medium there are those who still make the community an occasional cringe fest. THousands of twitter accounts with Anime Profile Pictures raging in threads about their opinions or chiming in with super weird takes on race in the cosplaying scene, being wayyy to overly thirsty for certain characters or worse... *gulp* thier takes in favor of oversexualized 'loli' content. But don't let that detract from how awesome Anime can be. If you've never watched any, reach out to the community for some reccomedations based on what you like! You never know, you may one day be a weeb like us too."
    },

    {
        "blog_title": "Biblical Names",
        "blog_body": "I wish names could be more diverse in my country. Although I think coming up with new names that work is extremely difficult to get right, how many more Johns, Jacobs, Matthews, Pauls, Josephs, Jameses, and the rest do we really need. I swaer half the men I know have a biblical name. It's time we start to get more creative. And I don't mean naming your child after fictional characters like 'Khaleesi', 'Katniss', 'Obi-wan', or 'Anakin'... that's just goofy. But I desperatly wish we could be creative with names without it all seeming so cringy."
    },

    {
        "blog_title": "Night Owl Syndrome",
        "blog_body": "I absolutely love being a night owl. When the sky turns dark and the whole hemisphere goes to bed I feel like the world is now just for me. It's my time to relax and be alone. I can do whatever I want in the wee hours of night, unbothered by the responsibiltiy of daytime. Although it comes with the great cost of being more tired during the day, I don't want to give it up. Maybe it's because I grew up an only child with a lot of free time. As I grew older and that free time started to dwindle away I found myself wanting to take it back at night. At night I feel free from the schackles of modern adulthood, not bound by a schedule, work, traffic, phnoecalls, emails etc. Free as any bird a night owl is, but alas, only until dawn."
    }
]